Tekla.Structures.ModelInternal.Operation.MEPIFCExportViewTypeEnum
View configuration type for MEP IFC export

Tekla.Structures.ModelInternal.Operation.MEPIFCExportViewTypeEnum.UNDEFINED


Tekla.Structures.ModelInternal.Operation.MEPIFCExportViewTypeEnum.IFC4_MEP_REFERENCE_VIEW


Tekla.Structures.ModelInternal.Operation.MEPIFCExportViewTypeEnum.IFC4_MEP_DESIGN_TRANSFER_VIEW


Tekla.Structures.ModelInternal.Operation.MEPIFCExportViewTypeEnum.IFC2X3_MEP_COORDINATION_VIEW


Tekla.Structures.ModelInternal.Operation.MEPIFCExportViewTypeEnum.IFC2X3_MEP_SURFACE_GEOMETRY_VIEW
